app/controllers/dash_board_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "justin@testemail.com"]]
---
    def new
        session[:log] = 1
        # flash.clear
        if(!session.nil?)
            @user = User.find_by(email: session[:email]) #why does first id make this nil in cucumber test